// *++
// 
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   TimeStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell time command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_TIME_THREE_VARS            #language eng  "%02d:%02d:%02d (GMT%hc%02d:%02d)\n"

#string STR_TIME_CLOCK_NOT_FUNC        #language eng  "%hs: Clock not functional\n"

#string STR_TIME_INVALID_HOUR          #language eng  "%hs: Invalid hour\n"

#string STR_TIME_INVALID_HOUR_RANGE    #language eng  "%hs: Invalid hour. Hour range: 0 - 23\n"

#string STR_TIME_INVALID_MINUTES       #language eng  "%hs: Invalid minutes\n"

#string STR_TIME_INVALID_MINUTES_RANGE #language eng  "%hs: Invalid minutes. Minute range: 0 - 59\n"

#string STR_TIME_INVALID_SECONDS       #language eng  "%hs: Invalid seconds\n"

#string STR_TIME_INVALID_SECONDS_RANGE #language eng  "%hs: Invalid seconds. Second range: 0 - 59\n"

#string STR_TIME_LINE_HELP             #language eng  "Displays the current time or sets the time of the system"

#string STR_TIME_VERBOSE_HELP          #language eng  "Displays the current time or sets the time of the system.\n"
                                                      "\n"
                                                      "TIME [hh:mm[:ss]]\n"
                                                      "\n"
                                                      "    hh    - Hour of time, Hour range: 0 - 23\n"
                                                      "    mm    - Minute of time, Minute range: 0 - 59\n"
                                                      "    ss    - Second of time, Second range: 0 - 59\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. Hour and minute are required to set the time.\n"
                                                      "    2. If second is not specified, 0 will be used as default.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display current time:\n"
                                                      "    fs0:\\> time\n"
                                                      "    16:51:03 (GMT+08:00)\n"
                                                      "\n"
                                                      "  * To set the system time:\n"
                                                      "    fs0:\\> time 9:51:30\n"
                                                      "    fs0:\\> time\n"
                                                      "    09:51:31 (GMT+08:00)\n"
